Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When a method annotated with `@CacheResult` is invoked, Quarkus will compute a cache key and use it to check in the cache whether the method has been already invoked. See the xref:cache-keys-building-logic[Cache keys building logic] section of this guide to learn how the cache key is computed. If a value is found in the cache, it is returned and the annotated method is never actually executed. If no value is found, the annotated method is invoked and the returned value is stored in the cache using the computed key.
ja_jp: `@CacheResult` でアノテーションされたメソッドが呼び出されると、Quarkusはキャッシュキーを計算し、そのキーを使用して、メソッドがすでに呼び出されているかどうかをキャッシュでチェックします。キャッシュキーの計算方法については、このガイドの xref:cache-keys-building-logic[キャッシュキーの構築ロジック] セクションを参照してください。キャッシュ内に値が見つかった場合、その値が返され、アノテーションメソッドが実際に実行されることはありません。値が見つからない場合は、アノテーション・メソッドが起動され、計算されたキーを使用して戻り値がキャッシュに格納されます。

source: When a method annotated with `@CacheResult` is invoked, Quarkus will use the method argument as the cache key and check in the cache whether the method has been already invoked. Methods with multiple parameters are not allowed. For composite keys, define a Protobuf schema that will hold multiple values. If a value is found in the cache, it is returned and the annotated method is never actually executed. If no value is found, the annotated method is invoked and the returned value is stored in the cache using the computed key. This annotation cannot be used on a method returning `void`.
ja_jp: `@CacheResult` でアノテーションされたメソッドが呼び出されると、Quarkus はメソッドの引数をキャッシュキーとして使用し、そのメソッドがすでに呼び出されているかどうかをキャッシュでチェックします。複数のパラメータを持つメソッドは許可されません。複合キーの場合は、複数の値を保持するProtobufスキーマを定義します。キャッシュ内に値が見つかった場合、その値を返し、アノテーションされたメソッドは実際に実行されることはありません。値が見つからない場合、アノテーションされたメソッドが呼び出され、返された値は計算されたキーを使用してキャッシュに格納されます。このアノテーションは、 `void` を返すメソッドには使用できません。

source: When a method argument is annotated with `@CacheKey`, it is identified as a part of the cache key during an invocation of a method annotated with `@CacheResult` or `@CacheInvalidate`.
ja_jp: メソッドの引数が `@CacheKey` でアノテーションされている場合、 `@CacheResult` または `@CacheInvalidate` でアノテーションされたメソッドの呼び出し時にキャッシュキーの一部として識別されます。

source: When a method is intended to produce a message written to the client, it can emit `null`. Emitting `null` signifies no response to be sent to the client, allowing for skipping a response when needed.
ja_jp: メソッドがクライアントに書き込まれるメッセージを生成することを意図している場合、 `null` を発行できます。 `null` を発行すると、クライアントにレスポンスが送信されないことを意味し、必要なときにレスポンスをスキップできるようになります。

source: When a native executable is created (explained in detail xref:building-native-image.adoc[here]), it is *always* built from a production application.
ja_jp: ネイティブ実行可能ファイルを作成する場合 (詳しくは link:building-native-image.html[こちら])、*常に* 本番アプリケーションからビルドされます。

source: When a new Quarkus project/module is to be generated, it is now possible to select the Quarkus stream (see https://quarkus.io/blog/quarkus-2x-platform-quarkiverse-registry/[this article]) on which the generated application will be based on.
ja_jp: 新しいQuarkusプロジェクト／モジュールを生成する際に、生成されるアプリケーションのベースとなるQuarkusストリーム（ link:https://quarkus.io/blog/quarkus-2x-platform-quarkiverse-registry/[こちらの記事]を参照）を選択できるようになりました。

source: When a new session cookie is created, either after a successful authorization code flow completion or a token refresh, it may be necessary to control how the session cookie is managed by HTTP cache intermediaries and the browser cache. Currently, only a `Cache-Control` `no-store` directive that prohibits caching the session cookie anywhere in the client request chain can be configured.
ja_jp: 認可コードフローの完了後、またはトークンのリフレッシュ後に新しいセッション Cookie が作成される際、HTTP キャッシュ中間サーバーやブラウザーキャッシュによってセッション Cookie がどのように管理されるかを制御する必要がある場合があります。現在、クライアントリクエストチェーンのどこにもセッション Cookie のキャッシュを禁止する `Cache-Control` `no-store` ディレクティブのみを設定可能です。

source: When a non-s2i container image extension is used, an `ImageStream` is created that is pointing to an external `dockerImageRepository`. The image is built and pushed to the registry and the `ImageStream` populates the tags that are available in the `dockerImageRepository`.
ja_jp: s2i コンテナイメージエクステンション以外を使用する場合、外部の `dockerImageRepository` を指し示す `ImageStream` が作成されます。イメージはビルドされてレジストリにプッシュされ、 `ImageStream` は `dockerImageRepository` で利用可能なタグを入力します。

source: When a path is registered with multiple permission sets, the permission sets explicitly specifying an HTTP method that matches the request take precedence. In this instance, the permission sets without methods only come into effect if the request method does not match permission sets with the method specification.
ja_jp: パスが複数の権限セットに登録されている場合、リクエストにマッチする HTTP メソッドを明示的に指定する権限セットが優先されます。 この場合、メソッドのない権限セットは、リクエストメソッドがメソッド仕様を持つ権限セットとマッチしない場合にのみ、有効になります。

source: When a persistence unit is configured at build time, and it is assigned entity types or an xref:datasource.adoc#datasource-active[active datasource], the persistence unit is active by default. Quarkus starts the corresponding Hibernate ORM `SessionFactory` when the application starts.
ja_jp: 永続化ユニットがビルド時に設定され、エンティティータイプまたは xref:datasource.adoc#datasource-active[アクティブなデータソース] が割り当てられている場合、その永続化ユニットはデフォルトでアクティブになります。Quarkus は、アプリケーションの起動時に対応する Hibernate ORM `SessionFactory` を開始します。

source: When a persistence unit is configured at build time, and it is assigned entity types or an xref:datasource.adoc#datasource-active[active datasource], the persistence unit is active by default. Quarkus starts the corresponding Hibernate Reactive `SessionFactory` when the application starts.
ja_jp: 永続化ユニットがビルド時に設定され、エンティティータイプまたは xref:datasource.adoc#datasource-active[アクティブなデータソース] が割り当てられている場合、永続化ユニットはデフォルトでアクティブになります。Quarkus は、アプリケーションの起動時に対応する Hibernate Reactive `SessionFactory` を開始します。

source: When a persistence unit is configured for Hibernate Search indexing at build time, Hibernate Search is active in that persistence unit by default. Quarkus starts Hibernate Search when the application starts.
ja_jp: 永続化ユニットがビルド時に Hibernate Search インデックス作成用に設定されている場合、その永続化ユニットでは、デフォルトで Hibernate Search がアクティブになります。アプリケーションの起動時に Quarkus が Hibernate Search を開始します。

source: When a proxy is configured with a Credentials Provider, the Proxy Registry automatically retrieves the credentials at startup. The retrieved credentials are applied to the proxy configuration.
ja_jp: プロキシーがクレデンシャルプロバイダーで設定されている場合、プロキシーレジストリーは起動時にクレデンシャルを自動的に取得します。取得されたクレデンシャルはプロキシー設定に適用されます。

source: When a security policy's `paths` property contains the most specific path that matches the current request path, it takes precedence over other security policies with matching paths and is said to win.
ja_jp: セキュリティーポリシーの `paths` プロパティーに現在のリクエストパスとマッチする最も具体的なパスが含まれている場合、それはマッチするパスを持つ他のセキュリティーポリシーよりも優先され、勝利すると言われます。

source: When a service has this label set to `true`, it will be excluded from service discovery, and extensions will not use it for Dev Services.
ja_jp: サービスにこのラベルが `true` に設定されている場合、そのサービスはサービスディスカバリーから除外され、エクステンションは Dev Services にそのサービスを使用しません。

source: When a subscription is created, Pulsar retains all messages, even if the consumer is disconnected. The retained messages are discarded only when a consumer acknowledges that all these messages are processed successfully.
ja_jp: サブスクリプションが作成されると、コンシューマーが切断されても、Pulsar はすべてのメッセージを保持します。 保持されたメッセージは、これらのメッセージがすべて正常に処理されたことをコンシューマーが確認した場合にのみ破棄されます。

source: When a token is directly encrypted with a public RSA or EC key, it cannot be verified which party sent the token. To address this, symmetric secret keys are preferred for direct encryption, especially when using JWT as cookies managed solely by the Quarkus endpoint.
ja_jp: トークンが公開 RSA または EC キーで直接暗号化されると、どの当事者がトークンを送信したかを確認できません。 これに対処するには、特に Quarkus エンドポイントによってのみ管理される Cookie として JWT を使用する場合、直接暗号化には対称秘密鍵が推奨されます。

source: When a user is redirected to the OIDC provider to authenticate, the redirect URL includes a `redirect_uri` query parameter that indicates where the user has to be redirected when authentication is complete. In our case, this is the Quarkus application. Quarkus sets this parameter to the current application request URL by default.
ja_jp: ユーザーが認証のために OIDC プロバイダーにリダイレクトされる場合、リダイレクト URL には、認証完了後のユーザーのリダイレクト先を示す `redirect_uri` クエリーパラメーターが含まれます。 ここでのリダイレクト先は Quarkus アプリケーションです。 Quarkus は、デフォルトでこのパラメーターを現在のアプリケーションリクエスト URL に設定します。

source: When a user is redirected to the OIDC provider to authenticate, the redirect URL includes a `redirect_uri` query parameter, which indicates to the provider where the user has to be redirected to when the authentication is complete. In our case, this is the Quarkus application.
ja_jp: ユーザーが認証のために OIDC プロバイダーにリダイレクトされる場合、リダイレクト URL には `redirect_uri` クエリーパラメーターが含まれます。このパラメーターは、認証完了後のユーザーのリダイレクト先をプロバイダーに示します。 ここでのリダイレクト先は Quarkus アプリケーションになります。

source: When a version is set explicitly, Quarkus will try to check this version against the actual database version on startup, leading to a startup failure when the actual version is lower.
ja_jp: バージョンが明示的に設定されている場合、Quarkusは起動時にこのバージョンを実際のデータベースバージョンと照合しようとするため、実際のバージョンが低い場合は起動に失敗することがあります。

source: When access to all uploaded files without specifying the form names is needed, RESTEasy Reactive allows the use of `@RestForm List<FileUpload>`, where it is important to **not** set a name for the link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] annotation.
ja_jp: フォーム名を指定せずにアップロードされたすべてのファイルにアクセスする必要がある場合、RESTEasy Reactive では `@RestForm List<FileUpload>` を使用できます。ここで、link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] アノテーションにnameを設定することは重要では**ありません**。

source: When accessing the properties you can either use the dot notation or bracket notation. In the `object.property` (dot notation) syntax, the `property` must be a <<identifiers,valid identifier>>. In the `object[property_name]` (bracket notation) syntax, the `property_name` has to be a non-null <<literals, literal>> value.
ja_jp: プロパティーにアクセスする際には、ドット表記とブラケット表記のどちらかを使うことができます。 `object.property` (ドット表記) 構文では、 `property` は <<identifiers,有効な識別子>> でなければなりません。 `object[property_name]` (ブラケット表記) 構文では、 `property_name` は null ではない <<literals, リテラル>> 値でなければなりません。

source: When accessing the properties you can either use the dot notation or bracket notation. In the `object.property` (dot notation) syntax, the `property` must be a <<identifiers,valid identifier>>. In the `object[property_name]` (bracket notation) syntax, the `property_name` has to be a non-null <<literals,literal>> value.
ja_jp: プロパティーにアクセスする際には、ドット表記とブラケット表記のどちらかを使用できます。 `object.property` (ドット表記) 構文では、`property` は <<identifiers,valid identifier>> でなければなりません。 `object[property_name]` (ブラケット表記) 構文では、`property_name` は null 以外の <<literals,literal>> 値でなければなりません。

source: When accessing the properties you can either use the dot notation or bracket notation. In the `object.property` (dot notation) syntax, the `property` must be a xref:identifiers[valid identifier]. In the `object[property_name]` (bracket notation) syntax, the `property_name` has to be a non-null xref:literals[literal] value.
ja_jp: プロパティにアクセスする際には、ドット記法とブラケット記法のいずれかを使用することができます。 `object.property` (ドット表記) 構文では、 `property` は xref:identifiers[有効な識別子] である必要があります。 `object[property_name]` (ブラケット表記) 構文では、 `property_name` は非 NULL xref:literals[リテラル] 値である必要があります。

source: When added, load shedding is enabled. It can be disabled by setting `quarkus.load-shedding.enabled` to `false`.
ja_jp: 追加すると、負荷制限が有効になります。 `quarkus.load-shedding.enabled` を `false` に設定することで無効にできます。

source: When added, this will result in a new entry under the `Assistant` heading in the log shortcut menu:
ja_jp: 追加すると、ログのショートカットメニューの `Assistant` 見出しの下に新しいエントリーが表示されます。

source: When adding `kotlin` to the extensions list, the Maven plugin will generate a project that is properly configured to work with Kotlin. Furthermore the `org.acme.ReactiveGreetingResource` class is implemented as Kotlin source code (as is the case with the generated tests). The addition of `resteasy-reactive-jackson` in the extension list results in importing the RESTEasy Reactive and Jackson extensions.
ja_jp: `kotlin` をエクステンションリストに追加すると、Maven プラグインは、Kotlin で動作するように適切に構成されたプロジェクトを生成します。さらに、 `org.acme.ReactiveGreetingResource` クラスは Kotlin のソースコードとして実装されます (生成されたテストも同様です)。エクステンションリストに `resteasy-reactive-jackson` を追加すると、RESTEasy Reactive および Jackson エクステンションがインポートされます。

source: When adding `kotlin` to the extensions list, the Maven plugin will generate a project that is properly configured to work with Kotlin. Furthermore, the `org.acme.ReactiveGreetingResource` class is implemented as Kotlin source code (as is the case with the generated tests). The addition of `rest-jackson` in the extension list results in importing the Quarkus REST (formerly RESTEasy Reactive) and Jackson extensions.
ja_jp: `kotlin` をエクステンションリストに追加すると、Maven プラグインは Kotlin で動作するように適切に設定されたプロジェクトを生成します。さらに、 `org.acme.ReactiveGreetingResource` クラスは Kotlin ソースコードとして実装されます (生成されるテストも同様)。エクステンションリストに `rest-jackson` を追加すると、Quarkus REST (旧 RESTEasy Reactive) および Jackson エクステンションがインポートされます。

source: When adding `kotlin` to the extensions list, the Maven plugin will generate a project that is properly configured to work with Kotlin. Furthermore, the `org.acme.ReactiveGreetingResource` class is implemented as Kotlin source code (as is the case with the generated tests). The addition of `resteasy-reactive-jackson` in the extension list results in importing the RESTEasy Reactive and Jackson extensions.
ja_jp: `kotlin` をエクステンションリストに追加すると、Maven プラグインは、Kotlin で動作するように適切に構成されたプロジェクトを生成します。さらに、 `org.acme.ReactiveGreetingResource` クラスは Kotlin のソースコードとして実装されます (生成されたテストも同様です)。エクステンションリストに `resteasy-reactive-jackson` を追加すると、RESTEasy Reactive および Jackson エクステンションがインポートされます。

source: When adding a new Hero, also broadcast it
ja_jp: 新しいHeroを追加する際にもブロードキャストします

source: When adding a new `Hero`, also broadcast it
ja_jp: 新しいヒーローの追加時に、ブロードキャストも行います

source: When adding constraints in your `ConstraintProvider`, keep an eye on the _score calculation speed_ in the `info` log, after solving for the same amount of time, to assess the performance impact:
ja_jp: `ConstraintProvider` に制約を追加するときは、同じ時間で解決した後、 `info` ログでの_スコア計算速度_に注意してパフォーマンスへの影響を評価してください。

source: When adding metrics for your extension, you may find yourself in one of the following situations:
ja_jp: エクステンションのメトリクスを追加するとき、以下のいずれかの状況に陥ることがあります:

source: When adding the `{web-locator-ga}` extension , you can see the files being served, and the generated importmap, in the Dev UI:
ja_jp: `{web-locator-ga}` エクステンションを追加する場合、Dev UI で提供されているファイルや生成されたインポートマップを見ることができます。

source: When all tests have finished, shutdown Wiremock.
ja_jp: すべてのテストが終了したら、Wiremockをシャットダウンします。

source: When an <<inclusive-authentication, inclusive authentication>> is enabled in a `lax` mode, every selected authentication mechanism will have a chance to provide its own `SecurityIdentity`, with at least one of the mechanisms expected to produce `SecurityIdentity`. Consider the following example:
ja_jp: <<inclusive-authentication, 統合認証>> が `lax` モードで有効な場合、選択されたすべての認証メカニズムは独自の `SecurityIdentity` を提供する機会を得ますが、少なくとも 1 つのメカニズムが `SecurityIdentity` を生成することが期待されます。次の例を考慮してください:

source: When an <<inclusive-authentication, inclusive authentication>> is enabled in a `strict` mode, every selected authentication mechanism must provide the `SecurityIdentity`. For example:
ja_jp: <<inclusive-authentication, 統合認証>> が `strict` モードで有効な場合、選択されたすべての認証メカニズムが `SecurityIdentity` を提供する必要があります。たとえば:

source: When an LRA is told to finish, i.e. when a method annotated with `@LRA(end = true, ...)` is invoked, the coordinator will instruct all services involved in the interaction to finish. If a service is unavailable (or still finishing) then the coordinator will retry periodically. It is the user's responsibility to restart failed services on the same endpoint that they used when they first joined the LRA, or to tell the coordinator that they wish to be notified on new endpoints. An LRA is not deemed finished until *all* participants have acknowledged that they have finished.
ja_jp: LRAが終了するように指示された場合、つまり、 `@LRA(end = true, …​)` でアノテーションされたメソッドが呼び出された場合、コーディネーターは対話に関わるすべてのサービスに終了するように指示します。サービスが利用できない場合（または終了中の場合）、コーディネーターは定期的に再試行します。失敗したサービスを、LRAに最初に参加したときに使用したのと同じエンドポイントで再起動するか、新しいエンドポイントでの通知を希望することをコーディネーターに伝えるのは、ユーザーの責任です。LRAは、 *すべての* 参加者が終了したことを確認するまで、終了したとはみなされません。

source: When an LRA is told to finish, i.e. when a method annotated with `@LRA(end = true, ...)` is invoked, the coordinator will instruct all services involved in the interaction to finish. If a service is unavailable (or still finishing) then the coordinator will retry periodically. It is the users responsibility to restart failed services on the same endpoint that they used when they first joined the LRA, or to tell the coordinator that they wish to be notified on new endpoints. An LRA is not deemed finished until *all* participants have acknowledged that they have finished.
ja_jp: LRAが終了するように指示された場合、つまり、 `@LRA(end = true, …​)` でアノテーションされたメソッドが呼び出された場合、コーディネーターは対話に関わるすべてのサービスに終了するように指示します。サービスが利用できない場合（または終了中の場合）、コーディネーターは定期的に再試行します。失敗したサービスを、LRAに最初に参加したときに使用したのと同じエンドポイントで再起動するか、新しいエンドポイントでの通知を希望することをコーディネーターに伝えるのは、ユーザーの責任です。LRAは、 *すべての* 参加者が終了したことを確認するまで、終了したとはみなされません。

source: When an OpenID Connect extension, `quarkus-oidc`, is used and token expires, Quarkus automatically closes connection.
ja_jp: OpenID Connect エクステンション (`quarkus-oidc`) が使用され、トークンの有効期限が切れると、Quarkus は自動的に接続を閉じます。

source: When an application consumes messages from Kafka, it uses a Kafka consumer. With this consumer, it polls batches of messages from a specific topic, for example, `movies` or `actors`. Retrieved messages belong to partitions assigned to this consumer. And that aspect is essential.
ja_jp: アプリケーションが Kafka からのメッセージを消費するとき、アプリケーションは Kafka コンシューマを使用します。このコンシューマでは、特定のトピック、例えば `movies` や `actors` などからのメッセージのバッチをポーリングします。取得したメッセージは、このコンシューマに割り当てられたパーティションに属します。そして、この点が重要です。

source: When an application that uses the TLS extension starts, the TLS registry performs several checks to ensure the configuration is correct:
ja_jp: TLS エクステンションを使用するアプリケーションが起動すると、TLS レジストリーは、設定が正しいことを確認するために、以下に示すいくつかのチェックを実行します。

source: When an authentication request is rejected by Quarkus Security, `HttpAuthenticationMechanism` sends an authentication challenge back to the client. The type of challenge depends on the authentication mechanism. For example, with the OIDC OpenID Connect (OIDC) Authorization Code Flow mechanism, a redirect URL gets generated and the client is sent back to the OpenID Connect provider to authenticate.
ja_jp: 認証要求がQuarkus Securityによって拒否されると、 `HttpAuthenticationMechanism` は、認証チャレンジをクライアントに返送されます。 チャレンジの種類は、認証メカニズムによって異なります。たとえば、OIDC OpenID Connect（OIDC）の認可コードフローメカニズムでは、リダイレクトURLが生成され、クライアントは認証のためにOpenID Connectプロバイダーに送り返されます。

source: When an authorization code flow access token is injected as `JsonWebToken`, its verification is automatically enabled, in addition to the mandatory ID token verification. If really needed, you can disable this code flow access token verification with `quarkus.oidc.authentication.verify-access-token=false`.
ja_jp: 認可コードフローアクセストークンが `JsonWebToken` として注入されると、必須の ID トークン検証に加えて、その検証が自動的に有効になります。本当に必要な場合は、 `quarkus.oidc.authentication.verify-access-token=false` を使用してこのコードフローアクセストークン検証を無効にできます。

source: When an entity is annotated with `@Cacheable`, all its field values are cached except for collections and relations to other entities.
ja_jp: エンティティが `@Cacheable` でアノテーションされているときは、コレクションと他のエンティティとの関係を除いて、そのすべてのフィールド値がキャッシュされます。

source: When an error occurs but no error handler can handle the failure, Quarkus uses the strategy specified by `quarkus.websockets-next.server.unhandled-failure-strategy`. For server endpoints, the error message is logged and the connection is closed by default. For client endpoints, the error message is logged by default.
ja_jp: エラーが発生しても、エラーハンドラーが失敗を処理できない場合、Quarkus は `quarkus.websockets-next.server.unhandled-failure-strategy` で指定されたストラテジーを使用します。 サーバーエンドポイントの場合、エラーメッセージがログに記録され、接続はデフォルトで閉じられます。 クライアントエンドポイントの場合、エラーメッセージはデフォルトでログに記録されます。

source: When an error or exception occurs, the error page includes a `Get help with this` button.
ja_jp: エラーや例外が発生すると、エラーページに `Get help with this` ボタンが表示されます。

source: When an exception is detected, you can press the `h` key in the quarkus log to open the *shortcut menu*. Under the `Assistant` heading, you'll see a new option like:
ja_jp: 例外が検出されると、 Quarkus ログで `h` キーを押して *ショートカットメニュー* を開くことができます。 `Assistant` 見出しの下に、以下のような新しいオプションが表示されます。

source: When an exception occurs in Quarkus REST request parameter handling code, the exception is not printed by default to the log (for security reasons). This can sometimes make it hard to understand why certain HTTP status codes are returned (as the Jakarta REST mandates the use of non-intuitive error codes in various cases). In such cases, users are encouraged to set the logging level for the `org.jboss.resteasy.reactive.server.handlers.ParameterHandler` category to `DEBUG` like so:
ja_jp: Quarkus RESTリクエストパラメータ処理コードで例外が発生した場合、例外はデフォルトでログに出力されません（セキュリティ上の理由から）。このため、特定のHTTPステータスコードが返される理由を理解するのが難しい場合があります（jakarta RESTでは、さまざまなケースで直感的でないエラーコードの使用が義務付けられているため）。このような場合、 `org.jboss.resteasy.reactive.server.handlers.ParameterHandler` カテゴリーのログレベルを `DEBUG` のように設定するとよいでしょう。

source: When an exception occurs in RESTEasy Reactive request parameter handling code, the exception is not printed by default to the log (for security reasons). This can sometimes make it hard to understand why certain HTTP status codes are returned (as the JAX-RS mandates the use of non-intuitive error codes in various cases). In such cases, users are encouraged to set the logging level for the `org.jboss.resteasy.reactive.server.handlers.ParameterHandler` category to `DEBUG` like so:
ja_jp: RESTEasy Reactive リクエストパラメータ処理コードで例外が発生した場合、例外はデフォルトでログに出力されません（セキュリティ上の理由による）。 このため、特定の HTTP ステータスコードが返される理由を理解するのが難しい場合があります（JAX-RS では、さまざまなケースで直感的でないエラーコードの使用が義務付けられているため）。 このような場合、ユーザーは次のようにして `org.jboss.resteasy.reactive.server.handlers.ParameterHandler` カテゴリのロギングレベルを `DEBUG` に設定することをお勧めします。

source: When an exception occurs in RESTEasy Reactive request parameter handling code, the exception is not printed by default to the log (for security reasons). This can sometimes make it hard to understand why certain HTTP status codes are returned (as the Jakarta REST mandates the use of non-intuitive error codes in various cases). In such cases, users are encouraged to set the logging level for the `org.jboss.resteasy.reactive.server.handlers.ParameterHandler` category to `DEBUG` like so:
ja_jp: RESTEasy Reactiveリクエストパラメータ処理コードで例外が発生した場合、例外はデフォルトでログに出力されません（セキュリティ上の理由から）。このため、特定のHTTPステータスコードが返される理由を理解するのが難しい場合があります（jakarta RESTでは、さまざまなケースで直感的でないエラーコードの使用が義務付けられているため）。このような場合、 `org.jboss.resteasy.reactive.server.handlers.ParameterHandler` カテゴリーのログレベルを `DEBUG` のように設定するとよいでしょう:

source: When an exception occurs, Quarkus REST does not log it by default (for security reasons). This can sometimes make it hard to understand why certain exception handling code was invoked (or not invoked). To make Quarkus REST log the actual exception before an exception mapping code is run the `org.jboss.resteasy.reactive.common.core.AbstractResteasyReactiveContext` log category can be set to `DEBUG` like so:
ja_jp: 例外が発生した場合、Quarkus REST はデフォルトでログを記録しません (セキュリティー上の理由による)。このため、特定の例外処理コードが呼び出された (または呼び出されなかった) 理由を理解するのが難しい場合があります。Quarkus REST が例外マッピングコードを実行する前に実際の例外をログ記録するには、次のように `org.jboss.resteasy.reactive.common.core.AbstractResteasyReactiveContext` ログカテゴリーを `DEBUG` に設定します。
